myrottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
#@movies = Movie.find(:all, :order=>'release_date')
   @movies = Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
---
  def show
      begin
      id = params[:id]
      @movie = Movie.find(id)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]
---
  def edit
    id = params[:id]
    @movie = Movie.find(id)

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "movies" SET "title" = 'Help this is changed', "release_date" = '2012-01-13 00:00:00.000000', "updated_at" = '2012-03-13 15:41:04.318475' WHERE "movies"."id" = 6
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 5]]
---
  def destroy
    @movie = Movie.find params[:id]
    @movie.destroy